Revit 2024 API
BuiltInFailures.ColumnInsideWallFailures.CopingWarningOffset Property
 Coping applied, but no cut was made. Adjust Coping Distance or Offset parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CopingWarningOffset { get; }
Visual Basic
Public Shared ReadOnly Property CopingWarningOffset As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CopingWarningOffset {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ColumnInsideWallFailures Class
Autodesk.Revit.DB Namespace